0.1.0/tutorials/incompressible/porous-simple/straight_duct_implicit/0/epsilon
// mousse: CFD toolbox

FoamFile
{
  version     2.0;
  format      ascii;
  class       volScalarField;
  location    "0";
  object      epsilon;
}

dimensions      [0 2 -3 0 0 0 0];
internalField   uniform 200;

boundaryField
{
  front
  {
    type            epsilonWallFunction;
    value           uniform 200;
  }
  back
  {
    type            epsilonWallFunction;
    value           uniform 200;
  }
  walls
  {
    type            epsilonWallFunction;
    value           uniform 200;
  }
  porosityWall
  {
    type            epsilonWallFunction;
    value           uniform 200;
  }
  inlet
  {
    type            turbulentMixingLengthDissipationRateInlet;
    mixingLength    0.005;
    value           uniform 200;
  }
  outlet
  {
    type            inletOutlet;
    inletValue      uniform 200;
    value           uniform 200;
  }
  porosity
  {
    type            zeroGradient;
  }
}

// vim: set ft=foam et sw=2 ts=2 sts=2:
