0.1.0/tutorials/incompressible/porous-simple/straight_duct_implicit/0/nut
// mousse: CFD toolbox

FoamFile
{
  version     2.0;
  format      ascii;
  class       volScalarField;
  location    "0";
  object      nut;
}

dimensions      [0 2 -1 0 0 0 0];
internalField   uniform 0;

boundaryField
{
  front
  {
    type            nutkWallFunction;
    value           uniform 0;
  }
  back
  {
    type            nutkWallFunction;
    value           uniform 0;
  }
  walls
  {
    type            nutkWallFunction;
    value           uniform 0;
  }
  porosityWall
  {
    type            nutkWallFunction;
    value           uniform 0;
  }
  inlet
  {
    type            calculated;
    value           uniform 0;
  }
  outlet
  {
    type            calculated;
    value           uniform 0;
  }
  porosity
  {
    type            zeroGradient;
  }
}

// vim: set ft=foam et sw=2 ts=2 sts=2:
