0.1.0/tutorials/incompressible/porous-simple/straight_duct_implicit/system/decomposeParDict
// mousse: CFD toolbox

FoamFile
{
  version     2.0;
  format      ascii;
  class       dictionary;
  object      decomposeParDict;
}

numberOfSubdomains  4;
//method              simple;
method              hierarchical;
simpleCoeffs
{
  n               (2 2 2);
  delta           0.001;
}
hierarchicalCoeffs
{
  n               (2 2 1);
  delta           0.001;
  order           xyz;
}
manualCoeffs
{
  dataFile        "";
}
distributed     no;
roots           ( );

// vim: set ft=foam et sw=2 ts=2 sts=2:
