0.1.0/tutorials/incompressible/porous-simple/straight_duct_implicit/system/foamyHexMeshDict
// mousse: CFD toolbox

FoamFile
{
  version     2.0;
  format      ascii;
  class       dictionary;
  object      foamyHexMeshDict;
}

#includeEtc "case_dicts/foamyHexMeshDict"
geometry
{
  #include "meshDict.geometry"
}
surfaceConformation
{
  locationInMesh (-0.078 0.02 0.0);
  featurePointControls
  {
    specialiseFeaturePoints         on;
    edgeAiming                      on;
    guardFeaturePoints              off;
    snapFeaturePoints               off;
    circulateEdges                  off;
  }
  geometryToConformTo
  {
    #include "meshDict.conformationSurfaces"
  }
  additionalFeatures
  {
    boundaryAndFaceZones
    {
      featureMethod           extendedFeatureEdgeMesh;
      extendedFeatureEdgeMesh "boundaryAndFaceZones.extendedFeatureEdgeMesh";
    }
  }
}
motionControl
{
  defaultCellSize         0.0035;
  minimumCellSizeCoeff    0;
  maxRefinementIterations 0;
  maxSmoothingIterations  100;
  shapeControlFunctions
  {
    #include "meshDict.shapeControlFunctions"
  }
  objOutput                   off;
  timeChecks                  off;
  printVertexInfo             off;
}
polyMeshFiltering
{
  filterEdges                         false;
  filterFaces                         off;
  writeTetDualMesh                    true;
  writeCellShapeControlMesh           false;
  writeBackgroundMeshDecomposition    false;
}
meshQualityControls
{
  #include "meshQualityDict"
}

// vim: set ft=foam et sw=2 ts=2 sts=2:
