0.1.0/tutorials/incompressible/porous-simple/straight_duct_implicit/system/surfaceFeatureExtractDict
// mousse: CFD toolbox

FoamFile
{
  version     2.0;
  format      ascii;
  class       dictionary;
  object      surfaceFeatureExtractDict;
}

boundaryAndFaceZones.stl
{
  extractionMethod    extractFromSurface;
  extractFromSurfaceCoeffs
  {
    includedAngle   120;
  }
  baffles (porosityFaces);
  // Write options
    writeObj        no; //yes;
}

// vim: set ft=foam et sw=2 ts=2 sts=2:
